## Развёртка bacend окружения
1. Я установил Ubuntu 22.04 lts на виртуальную машину
![](foto/f1.png)
Рисунок1 - VirtualBox менеджер
2. Далее в ней я установил java 17 jdk и jre версий
![](foto/f2.png)
Рисунок2 - Начало установки java 17
![](foto/f3.png)
Рисунок3 - Установка java 17, после подтвердения установки
![](foto/f4.png)
Рисунок4 - Проверка корректности установки java 17
3. Затем я Установил Postgresql server через оффициальнный репозитарий
![](foto/f5.png)
Рисунок5 - Установка репозитария
![](foto/f6.png)
Рисунок6 - Обновление пакетов
![](foto/f7.png)
Рисунок7 - Установка Postgresql server с этого репозитария
![](foto/f8.png)
Рисунок8 - 35% установки Postgresql server после потверждения установки
![](foto/f9.png)
Рисунок9 - Проверка корректности установки Postgresql server
![](foto/f10.png)
Рисунок10 - Настройка Postgresql server
4. Я создал базу данных "samojlov" и подключился к ней.
![](foto/f11.png)
Рисунок11 - Создание и подключение к базе данных
5. Я создал в этой базе данных таблицы users и profile
![](foto/f12.png)
Рисунок12 - Создание таблицы users
![](foto/f13.png)
Рисунок13 - Создание таблицы profile
6. Я вставил в них по 2 значения
![](foto/f14.png)
Рисунок14 - Вставка значений
7. Затем в vs code я подключился к этой же базе данных
![](foto/f15.png)
Рисунок15 - Установка разширения для подключения к postgresql
![](foto/f16.png)
Рисунок16 - Подключение к базе данных из-под vs code
8. Затем уже в vs code я создал пару запросов для базы данных
![](foto/f17.png)
Рисунок17 - Запрос 1
![](foto/f18.png)
Рисунок18 - Запрос 2
9. Я установил maven в систему
![](foto/f19.png)
Рисунок19 - Начало установки maven
![](foto/f20.png)
Рисунок20 - Установка maven после подтверждения
![](foto/f21.png)
Рисунок21 - Проверка корректности установки maven
10. В vs code я установил разширения для работы с java и maven
![](foto/f22.png)
Рисунок22 - Установка extention пака для работы с java и maven
11. Я установил разширение spring initializr
![](foto/f23.png)
Рисунок23 - Установка spring initializr
12. Я создал spring проект с помщью этого разширения
![](foto/f24.png)
Рисунок24 - Контестное меню создания проекта
![](foto/f25.png)
Рисунок25 - Созданный проект
13. Я запустил этот проект из-под встроенной консоли в vs code
![](foto/f26.png)
Рисунок26 - Запущенный проект